Tekla.Structures.CatalogInternal.ShapeHandler.CleanAndModifyByName(System.String,System.Boolean@)
Selects a shape by its name, then cleans and stores the shape into the shape catalog
name: An input parameter that defines the name of the shape to clean
isSolid: A reference that will get set to true if the result is a solid
Returns: True if cleaning and storing to catalog was successful